HAMES2-1st-3/TunnelComfortSystemTesting/include/tc38xa/IfxDam_bf.h
/** \brief Length for Ifx_DAM_MEMCON_Bits.ROM */
#define IFX_DAM_MEMCON_ROM_LEN (1u)

/** \brief Mask for Ifx_DAM_MEMCON_Bits.ROM */
#define IFX_DAM_MEMCON_ROM_MSK (0x1u)

/** \brief Offset for Ifx_DAM_MEMCON_Bits.ROM */
#define IFX_DAM_MEMCON_ROM_OFF (0u)

/** \brief Length for Ifx_DAM_MEMCON_Bits.INTERR */
#define IFX_DAM_MEMCON_INTERR_LEN (1u)

/** \brief Mask for Ifx_DAM_MEMCON_Bits.INTERR */
#define IFX_DAM_MEMCON_INTERR_MSK (0x1u)

/** \brief Offset for Ifx_DAM_MEMCON_Bits.INTERR */
#define IFX_DAM_MEMCON_INTERR_OFF (2u)

/** \brief Length for Ifx_DAM_MEMCON_Bits.RMWERR */
#define IFX_DAM_MEMCON_RMWERR_LEN (1u)

/** \brief Mask for Ifx_DAM_MEMCON_Bits.RMWERR */
#define IFX_DAM_MEMCON_RMWERR_MSK (0x1u)

/** \brief Offset for Ifx_DAM_MEMCON_Bits.RMWERR */
#define IFX_DAM_MEMCON_RMWERR_OFF (4u)

/** \brief Length for Ifx_DAM_MEMCON_Bits.DATAERR */
#define IFX_DAM_MEMCON_DATAERR_LEN (1u)

/** \brief Mask for Ifx_DAM_MEMCON_Bits.DATAERR */
#define IFX_DAM_MEMCON_DATAERR_MSK (0x1u)

/** \brief Offset for Ifx_DAM_MEMCON_Bits.DATAERR */
#define IFX_DAM_MEMCON_DATAERR_OFF (6u)

/** \brief Length for Ifx_DAM_MEMCON_Bits.ADDERR */
#define IFX_DAM_MEMCON_ADDERR_LEN (1u)

/** \brief Mask for Ifx_DAM_MEMCON_Bits.ADDERR */
#define IFX_DAM_MEMCON_ADDERR_MSK (0x1u)

/** \brief Offset for Ifx_DAM_MEMCON_Bits.ADDERR */
#define IFX_DAM_MEMCON_ADDERR_OFF (7u)

/** \brief Length for Ifx_DAM_MEMCON_Bits.PMIC */
#define IFX_DAM_MEMCON_PMIC_LEN (1u)

/** \brief Mask for Ifx_DAM_MEMCON_Bits.PMIC */
#define IFX_DAM_MEMCON_PMIC_MSK (0x1u)

/** \brief Offset for Ifx_DAM_MEMCON_Bits.PMIC */
#define IFX_DAM_MEMCON_PMIC_OFF (8u)

/** \brief Length for Ifx_DAM_MEMCON_Bits.ERRDIS */
#define IFX_DAM_MEMCON_ERRDIS_LEN (1u)

/** \brief Mask for Ifx_DAM_MEMCON_Bits.ERRDIS */
#define IFX_DAM_MEMCON_ERRDIS_MSK (0x1u)

/** \brief Offset for Ifx_DAM_MEMCON_Bits.ERRDIS */
#define IFX_DAM_MEMCON_ERRDIS_OFF (9u)

/** \brief Length for Ifx_DAM_RGN_LA_Bits.ADDR */
#define IFX_DAM_RGN_LA_ADDR_LEN (27u)

/** \brief Mask for Ifx_DAM_RGN_LA_Bits.ADDR */
#define IFX_DAM_RGN_LA_ADDR_MSK (0x7ffffffu)

/** \brief Offset for Ifx_DAM_RGN_LA_Bits.ADDR */
#define IFX_DAM_RGN_LA_ADDR_OFF (5u)

/** \brief Length for Ifx_DAM_RGN_UA_Bits.ADDR */
#define IFX_DAM_RGN_UA_ADDR_LEN (27u)

/** \brief Mask for Ifx_DAM_RGN_UA_Bits.ADDR */
#define IFX_DAM_RGN_UA_ADDR_MSK (0x7ffffffu)

/** \brief Offset for Ifx_DAM_RGN_UA_Bits.ADDR */
#define IFX_DAM_RGN_UA_ADDR_OFF (5u)

/** \brief Length for Ifx_DAM_RGN_ACCENA_Bits.EN0 */
#define IFX_DAM_RGN_ACCENA_EN0_LEN (1u)

/** \brief Mask for Ifx_DAM_RGN_ACCENA_Bits.EN0 */
#define IFX_DAM_RGN_ACCENA_EN0_MSK (0x1u)

/** \brief Offset for Ifx_DAM_RGN_ACCENA_Bits.EN0 */
#define IFX_DAM_RGN_ACCENA_EN0_OFF (0u)

/** \brief Length for Ifx_DAM_RGN_ACCENA_Bits.EN1 */
#define IFX_DAM_RGN_ACCENA_EN1_LEN (1u)

/** \brief Mask for Ifx_DAM_RGN_ACCENA_Bits.EN1 */
#define IFX_DAM_RGN_ACCENA_EN1_MSK (0x1u)

/** \brief Offset for Ifx_DAM_RGN_ACCENA_Bits.EN1 */
#define IFX_DAM_RGN_ACCENA_EN1_OFF (1u)

/** \brief Length for Ifx_DAM_RGN_ACCENA_Bits.EN2 */
#define IFX_DAM_RGN_ACCENA_EN2_LEN (1u)

/** \brief Mask for Ifx_DAM_RGN_ACCENA_Bits.EN2 */
#define IFX_DAM_RGN_ACCENA_EN2_MSK (0x1u)

/** \brief Offset for Ifx_DAM_RGN_ACCENA_Bits.EN2 */
#define IFX_DAM_RGN_ACCENA_EN2_OFF (2u)

/** \brief Length for Ifx_DAM_RGN_ACCENA_Bits.EN3 */
#define IFX_DAM_RGN_ACCENA_EN3_LEN (1u)

/** \brief Mask for Ifx_DAM_RGN_ACCENA_Bits.EN3 */
#define IFX_DAM_RGN_ACCENA_EN3_MSK (0x1u)

/** \brief Offset for Ifx_DAM_RGN_ACCENA_Bits.EN3 */
#define IFX_DAM_RGN_ACCENA_EN3_OFF (3u)

/** \brief Length for Ifx_DAM_RGN_ACCENA_Bits.EN4 */
#define IFX_DAM_RGN_ACCENA_EN4_LEN (1u)

/** \brief Mask for Ifx_DAM_RGN_ACCENA_Bits.EN4 */
#define IFX_DAM_RGN_ACCENA_EN4_MSK (0x1u)

/** \brief Offset for Ifx_DAM_RGN_ACCENA_Bits.EN4 */
#define IFX_DAM_RGN_ACCENA_EN4_OFF (4u)

/** \brief Length for Ifx_DAM_RGN_ACCENA_Bits.EN5 */
#define IFX_DAM_RGN_ACCENA_EN5_LEN (1u)

/** \brief Mask for Ifx_DAM_RGN_ACCENA_Bits.EN5 */
#define IFX_DAM_RGN_ACCENA_EN5_MSK (0x1u)

/** \brief Offset for Ifx_DAM_RGN_ACCENA_Bits.EN5 */
#define IFX_DAM_RGN_ACCENA_EN5_OFF (5u)

/** \brief Length for Ifx_DAM_RGN_ACCENA_Bits.EN6 */
#define IFX_DAM_RGN_ACCENA_EN6_LEN (1u)

/** \brief Mask for Ifx_DAM_RGN_ACCENA_Bits.EN6 */
#define IFX_DAM_RGN_ACCENA_EN6_MSK (0x1u)

/** \brief Offset for Ifx_DAM_RGN_ACCENA_Bits.EN6 */
#define IFX_DAM_RGN_ACCENA_EN6_OFF (6u)

/** \brief Length for Ifx_DAM_RGN_ACCENA_Bits.EN7 */
#define IFX_DAM_RGN_ACCENA_EN7_LEN (1u)

/** \brief Mask for Ifx_DAM_RGN_ACCENA_Bits.EN7 */
#define IFX_DAM_RGN_ACCENA_EN7_MSK (0x1u)

/** \brief Offset for Ifx_DAM_RGN_ACCENA_Bits.EN7 */
#define IFX_DAM_RGN_ACCENA_EN7_OFF (7u)

/** \brief Length for Ifx_DAM_RGN_ACCENA_Bits.EN8 */
#define IFX_DAM_RGN_ACCENA_EN8_LEN (1u)

/** \brief Mask for Ifx_DAM_RGN_ACCENA_Bits.EN8 */
#define IFX_DAM_RGN_ACCENA_EN8_MSK (0x1u)

/** \brief Offset for Ifx_DAM_RGN_ACCENA_Bits.EN8 */
#define IFX_DAM_RGN_ACCENA_EN8_OFF (8u)

/** \brief Length for Ifx_DAM_RGN_ACCENA_Bits.EN9 */
#define IFX_DAM_RGN_ACCENA_EN9_LEN (1u)

/** \brief Mask for Ifx_DAM_RGN_ACCENA_Bits.EN9 */
#define IFX_DAM_RGN_ACCENA_EN9_MSK (0x1u)

/** \brief Offset for Ifx_DAM_RGN_ACCENA_Bits.EN9 */
#define IFX_DAM_RGN_ACCENA_EN9_OFF (9u)

/** \brief Length for Ifx_DAM_RGN_ACCENA_Bits.EN10 */
#define IFX_DAM_RGN_ACCENA_EN10_LEN (1u)

/** \brief Mask for Ifx_DAM_RGN_ACCENA_Bits.EN10 */
#define IFX_DAM_RGN_ACCENA_EN10_MSK (0x1u)

/** \brief Offset for Ifx_DAM_RGN_ACCENA_Bits.EN10 */
#define IFX_DAM_RGN_ACCENA_EN10_OFF (10u)

/** \brief Length for Ifx_DAM_RGN_ACCENA_Bits.EN11 */
#define IFX_DAM_RGN_ACCENA_EN11_LEN (1u)

/** \brief Mask for Ifx_DAM_RGN_ACCENA_Bits.EN11 */
#define IFX_DAM_RGN_ACCENA_EN11_MSK (0x1u)

/** \brief Offset for Ifx_DAM_RGN_ACCENA_Bits.EN11 */
#define IFX_DAM_RGN_ACCENA_EN11_OFF (11u)

/** \brief Length for Ifx_DAM_RGN_ACCENA_Bits.EN12 */
#define IFX_DAM_RGN_ACCENA_EN12_LEN (1u)

/** \brief Mask for Ifx_DAM_RGN_ACCENA_Bits.EN12 */
#define IFX_DAM_RGN_ACCENA_EN12_MSK (0x1u)

/** \brief Offset for Ifx_DAM_RGN_ACCENA_Bits.EN12 */
#define IFX_DAM_RGN_ACCENA_EN12_OFF (12u)

